In [1]:
import numpy as np
import pandas as pd

In [4]:
from numpy.random import randn

In [5]:
df = pd.DataFrame(randn(4, 3), ['a', 'b', 'c', 'd'], ['X', 'Y', 'Z'])

In [6]:
df

          X         Y         Z
a -0.065841  0.286057  2.151273
b  0.942957  0.231411 -1.769292
c -0.872787  0.932893  0.601023
d -0.194724  0.608279 -1.670021

In [7]:
df > 0

       X     Y      Z
a  False  True   True
b   True  True  False
c  False  True   True
d  False  True  False

In [8]:
bool_df = df > 0
df[bool_df]

          X         Y         Z
a       NaN  0.286057  2.151273
b  0.942957  0.231411       NaN
c       NaN  0.932893  0.601023
d       NaN  0.608279       NaN

In [9]:
df[ df>0 ]

          X         Y         Z
a       NaN  0.286057  2.151273
b  0.942957  0.231411       NaN
c       NaN  0.932893  0.601023
d       NaN  0.608279       NaN

In [10]:
df

          X         Y         Z
a -0.065841  0.286057  2.151273
b  0.942957  0.231411 -1.769292
c -0.872787  0.932893  0.601023
d -0.194724  0.608279 -1.670021

In [12]:
df['Z'] > 0

a     True
b    False
c     True
d    False
Name: Z, dtype: bool

In [13]:
df[ df['Z']>0 ]

          X         Y         Z
a -0.065841  0.286057  2.151273
c -0.872787  0.932893  0.601023

In [14]:
df

          X         Y         Z
a -0.065841  0.286057  2.151273
b  0.942957  0.231411 -1.769292
c -0.872787  0.932893  0.601023
d -0.194724  0.608279 -1.670021

In [15]:
df[ df['X']<0 ]

          X         Y         Z
a -0.065841  0.286057  2.151273
c -0.872787  0.932893  0.601023
d -0.194724  0.608279 -1.670021

In [16]:
df[ df['X']<0 ]['Z']

a    2.151273
c    0.601023
d   -1.670021
Name: Z, dtype: float64

In [17]:
df[ df['X']<0 ][['Z', 'X']]

          Z         X
a  2.151273 -0.065841
c  0.601023 -0.872787
d -1.670021 -0.194724

In [18]:
df

          X         Y         Z
a -0.065841  0.286057  2.151273
b  0.942957  0.231411 -1.769292
c -0.872787  0.932893  0.601023
d -0.194724  0.608279 -1.670021

In [20]:
df[ (df['X'] > 0) & (df['Z'] < 0) ]

          X         Y         Z
b  0.942957  0.231411 -1.769292

In [21]:
df[ (df['X'] > 0) | (df['Z'] < 0) ]

          X         Y         Z
b  0.942957  0.231411 -1.769292
d -0.194724  0.608279 -1.670021

In [22]:
df.reset_index()

  index         X         Y         Z
0     a -0.065841  0.286057  2.151273
1     b  0.942957  0.231411 -1.769292
2     c -0.872787  0.932893  0.601023
3     d -0.194724  0.608279 -1.670021

In [23]:
z1 = [1, 3, 5, 6]
df['Z1'] = z1
df

          X         Y         Z  Z1
a -0.065841  0.286057  2.151273   1
b  0.942957  0.231411 -1.769292   3
c -0.872787  0.932893  0.601023   5
d -0.194724  0.608279 -1.670021   6

In [24]:
df.set_index('Z1')

           X         Y         Z
Z1
1  -0.065841  0.286057  2.151273
3   0.942957  0.231411 -1.769292
5  -0.872787  0.932893  0.601023
6  -0.194724  0.608279 -1.670021